smartinou/map/projects/beastfeedher/firmware/builds/lm3s6965/BSP.cpp
// GPIO port C interrupt handler.
void GPIOPortC_IRQHandler(void);
void GPIOPortC_IRQHandler(void) {

    // Get the state of the GPIO and issue the corresponding event.
    static const bool lIsMasked = true;
    unsigned long lIntStatus = GPIOPinIntStatus(GPIO_PORTC_BASE, lIsMasked);
    unsigned int lPin = BSP::mManualFeedButton.GetPin();
    if (lPin & lIntStatus) {
        GPIOPinIntClear(GPIO_PORTC_BASE, lPin);

        static PFPP::Event::ManualFeedCmd const sOnEvt(FEED_MGR_MANUAL_FEED_CMD_SIG, true);
        static PFPP::Event::ManualFeedCmd const sOffEvt(FEED_MGR_MANUAL_FEED_CMD_SIG, false);
        // Decouple using framework PUBLISH() method instead of direct posting to AO.
        if (Button::PRESSED == BSP::mManualFeedButton.GetGPIOPinState()) {
            QP::QF::PUBLISH(&sOnEvt, 0);
        } else {
            QP::QF::PUBLISH(&sOffEvt, 0);
        }
    }
}


// GPIO port D interrupt handler.
void GPIOPortD_IRQHandler(void);
void GPIOPortD_IRQHandler(void) {

    // Get the state of the GPIO and issue the corresponding event.
    static const bool lIsMasked = true;
    unsigned long lIntStatus = GPIOPinIntStatus(GPIO_PORTD_BASE, lIsMasked);
    unsigned int lPin = BSP::mTimedFeedButton.GetPin();
    if (lPin & lIntStatus) {
        GPIOPinIntClear(GPIO_PORTD_BASE, lPin);
        // Only interested in the pin coming high.
        if (Button::PRESSED == BSP::mTimedFeedButton.GetGPIOPinState()) {
            static PFPP::Event::TimedFeedCmd const sEvt(FEED_MGR_TIMED_FEED_CMD_SIG, 0);
            QP::QF::PUBLISH(&sEvt, 0);
        }
    }
}


// GPIO port F interrupt handler.
void GPIOPortF_IRQHandler(void);
void GPIOPortF_IRQHandler(void) {

    // Get the state of the GPIO and issue the corresponding event.
    static const bool lIsMasked = true;
    unsigned long lIntStatus = GPIOPinIntStatus(GPIO_PORTF_BASE, lIsMasked);
    unsigned int lPin = BSP::mSelectButton.GetPin();
    if (lPin & lIntStatus) {
        GPIOPinIntClear(GPIO_PORTF_BASE, lPin);
        // Only interested in the pin coming high.
        if (Button::PRESSED == BSP::mSelectButton.GetGPIOPinState()) {
            static QP::QEvt const sEvt(DISPLAY_REFRESH_SIG);
            //DisplayMgr_AO::AOInstance().POST(&sEvt, 0);
            QP::QF::PUBLISH(&sEvt, 0);
        }
    }
}


void UART0_IRQHandler(void);
#ifdef Q_SPY
// ISR for receiving bytes from the QSPY Back-End
// NOTE: This ISR is "QF-unaware" meaning that it does not interact with
// the QF/QK and is not disabled.
// Such ISRs don't need to call QK_ISR_ENTRY/QK_ISR_EXIT
// and they cannot post or publish events.
//
void UART0_IRQHandler(void) {

    // Get the raw interrupt status.
    // Clear the asserted interrupts.
    unsigned long lStatus = UARTIntStatus(UART0_BASE, true);
    UARTIntStatus(UART0_BASE, lStatus);

    // While RX FIFO NOT empty.
    while (UARTCharsAvail(UART0_BASE)) {
        unsigned long lLongByte = UARTCharGet(UART0_BASE);
        uint8_t lByte = static_cast<uint8_t>(lLongByte);
        QP::QS::rxPut(lByte);
    }
}

#else // Q_SPY
void UART0_IRQHandler(void) {
    // Intentional empty function body.
}
#endif // Q_SPY


// TODO: make this conditional to Ethernet support.

void Ethernet_IRQHandler(void);
void Ethernet_IRQHandler(void) {
    //ISR_Ethernet();
    //if (mEthernetCallback) {
    //mEtherCallback();
    //}
}


} // extern C

// *****************************************************************************
//                                END OF FILE
// *****************************************************************************
